000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/СуммоваяОценкаПереоценок/СуммоваяОценкаПереоценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СуммоваяОценкаПереоценок</name>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Акция</name>
    <comment>Признак акционной цены</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипПереоценки</name>
    <type>
      <types>EnumRef.ТипыПереоценок</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АналитикаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.АналитикаХозяйственныхОпераций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>EnumRef.ВариантыВеденияДополнительныхДанныхПоНоменклатуре</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКоличествоСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьНомерСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокГодностиСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристик</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаИспользованияСерий</name>
    <type>
      <types>EnumRef.НастройкиИспользованияСерийНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьУказанияСрокаГодностиСерии</name>
    <type>
      <types>EnumRef.ТочностиУказанияСрокаГодности</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЦенника</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГарантии</name>
    <comment>Срок гарантии (мес.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПроекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьЦенник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолитикиУчетаСерий</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолитикаУчетаСерий</name>
      <type>
        <types>CatalogRef.ПолитикиУчетаСерий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Основная организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/СуммоваяОценкаПереоценок/Forms/Форма/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	Тз = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Сумма");
	ТЗ.Колонки.Добавить("Магазин");
	ТЗ.Колонки.Добавить("IDN");
	
	Запрос = Новый Запрос;
	Запрос.Текст  = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
		|	ЦеныНоменклатуры.Цена КАК Цена,
		|	ЦеныНоменклатуры.Период КАК Период,
		|	ЦеныНоменклатуры.Номенклатура.IDN КАК IDN
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|ГДЕ
		|	ЦеныНоменклатуры.Период МЕЖДУ &ПериодС И &ПериодПо
		|	И ВЫБОР
		|			КОГДА &ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЦеныНоменклатуры.ВидЦены = &ВидЦены
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЦеныНоменклатуры.Номенклатура.ВидНоменклатуры = &Проект
		|		КОНЕЦ
		|ИТОГИ ПО
		|	ВидЦены";
			
	Если ЗначениеЗаполнено(ЭтотОбъект.МагазинДляОтбора) тогда 
		ПравилоЦенообразования =   ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект.МагазинДляОтбора,"ВидЦены");
		ВидЦены = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПравилоЦенообразования,"ВидЦены");
	Иначе	
		ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
	КонецЕсли;
	Запрос.УстановитьПараметр("ПериодПо", ТекПериод.ДатаОкончания);
	Запрос.УстановитьПараметр("ПериодС", ТекПериод.ДатаНачала);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Проект", ЭтотОбъект.Проект);
	
	Сообщить("Начало " + ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВидЦены = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ВидЦены");
	Сообщить("Запрос " + ТекущаяДата());
	Пока ВыборкаВидЦены.Следующий() Цикл
		Магазин = НайтиМагизин(ВыборкаВидЦены.ВидЦены);
		Выборка = ВыборкаВидЦены.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПредЦена = ПолучитьПредЦену(Выборка.Номенклатура,Выборка.ВидЦены,Выборка.Период);
			РазницаЦен =  Выборка.Цена - ПредЦена;
			Кол = ПолучитьКол(Выборка.Номенклатура,Магазин,Выборка.Период);
			Если Кол <> 0 и  РазницаЦен  <> 0  тогда 
				Строка = Тз.Добавить();
				Строка.Сумма = Кол * РазницаЦен;
				Строка.Номенклатура = Выборка.Номенклатура;
				Строка.Магазин = Магазин;
				Строка.IDN = Выборка.IDN;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТЗ.Свернуть("Номенклатура,Магазин,IDN","Сумма");
	Объект.ТабличнаяЧасть.Загрузить(ТЗ);	
	Сообщить("Конец " + ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры


&НаСервере
Функция ПолучитьПредЦену(Номенклатура,ВидЦены,ДатаСреза)
	Цена = 0;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Период,
		|			ВидЦены = &ВидЦены
		|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	ПредДень = НачалоДня(ДатаСреза) - 2;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Период", ПредДень);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Цена = Выборка.Цена;
	КонецЦикла;
	Возврат Цена;	
КонецФункции


&НаСервере
Функция ПолучитьКол(Номенклатура,Магазин,ДатаСреза)
	Кол = 0;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&период,
		|			Номенклатура = &Номенклатура
		|				И Склад.Магазин = &Магазин) КАК ТоварыНаСкладахОстатки";
	ПредДень = НачалоДня(ДатаСреза) - 2;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("Период", ПредДень);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Кол = Выборка.КоличествоОстаток;
	КонецЦикла;
	Возврат Кол;	
КонецФункции


&НаСервере
Функция НайтиМагизин(ВидЦен)
	Магазин = Справочники.Магазины.ПустаяСсылка();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Магазины.Ссылка КАК Магазин
		|ИЗ
		|	Справочник.Магазины КАК Магазины
		|ГДЕ
		|	Магазины.ПравилоЦенообразования.ВидЦен = &ВидЦен";
	Запрос.УстановитьПараметр("ВидЦен", ВидЦен);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Магазин = Выборка.Магазин;
	КонецЦикла;
	Возврат Магазин;	
КонецФункции


&НаСервере
Процедура СформироватьНаСервере2()
	Тз = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Сумма");
	ТЗ.Колонки.Добавить("Магазин");
	ТЗ.Колонки.Добавить("IDN");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.ВидЦены КАК ВидЦены,
		|	НАЧАЛОПЕРИОДА(ЦеныНоменклатуры.Период, ДЕНЬ) КАК Период
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|ГДЕ
		|	ЦеныНоменклатуры.Период МЕЖДУ &ПериодС И &ПериодПо
		|	И ВЫБОР
		|			КОГДА &ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЦеныНоменклатуры.ВидЦены = &ВидЦены
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатуры.ВидЦены,
		|	НАЧАЛОПЕРИОДА(ЦеныНоменклатуры.Период, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидЦены,
		|	Период
		|ИТОГИ ПО
		|	ВидЦены,
		|	Период";
	
	Если ЗначениеЗаполнено(ЭтотОбъект.МагазинДляОтбора) тогда 
		ПравилоЦенообразования =   ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект.МагазинДляОтбора,"ПравилоЦенообразования");
		ВидЦены = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПравилоЦенообразования,"ВидЦен");
	Иначе	
		ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
	КонецЕсли;
	Запрос.УстановитьПараметр("ПериодПо", ТекПериод.ДатаОкончания);
	Запрос.УстановитьПараметр("ПериодС", ТекПериод.ДатаНачала);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	//Сообщить("Начало " + ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВидЦены = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ВидЦены");
	//Сообщить("Запрос " + ТекущаяДата());
	Пока ВыборкаВидЦены.Следующий() Цикл
		МагазинОтбор = НайтиМагизин(ВыборкаВидЦены.ВидЦены);
			Выборка = ВыборкаВидЦены.Выбрать();
			Пока Выборка.Следующий() Цикл
				Таб = ПолучитьТаб(ВыборкаВидЦены.ВидЦены,Выборка.Период,МагазинОтбор);
				Для каждого строка из  Таб цикл
				//Кол = строка.Кол;
				строкаТЗ = Тз.Добавить();
				строкаТЗ.Сумма = строка.Сумма;
				строкаТЗ.Номенклатура = строка.Номенклатура;
				строкаТЗ.IDN = строка.IDN; 				
				строкаТЗ.Магазин = МагазинОтбор;
				КонецЦикла;
			КонецЦикла;
	КонецЦикла;
	
	ТЗ.Свернуть("Номенклатура,Магазин,IDN","Сумма");
	Объект.ТабличнаяЧасть.Загрузить(ТЗ);	
	//Сообщить("Конец " + ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаб(Видцены,текДата,Магазин)
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ЦеныНоменклатурыПредыдущие.Цена, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ (ЦеныНоменклатурыПредыдущие.Цена - ЦеныНоменклатуры.Цена) * ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КоличествоОстаток, 0)
		|		КОНЕЦ) КАК Сумма,
		|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПредДень, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыПредыдущие
		|		ПО ЦеныНоменклатуры.Номенклатура = ЦеныНоменклатурыПредыдущие.Номенклатура
		|			И ЦеныНоменклатуры.ВидЦены = ЦеныНоменклатурыПредыдущие.ВидЦены
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&ТекДата, Склад.Магазин = &Магазин) КАК ТоварыКОтгрузкеОстатки
		|		ПО ЦеныНоменклатуры.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ЦеныНоменклатуры.Период, ДЕНЬ) = &ТекДата
		|	И ЦеныНоменклатуры.ВидЦены = &ВидЦены
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЦеныНоменклатуры.Номенклатура.ВидНоменклатуры = &Проект
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатуры.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблица.Сумма КАК Сумма,
		|	ВременнаяТаблица.Номенклатура.IDN КАК IDN
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|ГДЕ
		|	ВременнаяТаблица.Сумма <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблица";
	ПредДень =  ТекДата -2;
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("ПредДень", ПредДень);
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекДата));
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("Проект", ЭтотОбъект.Проект);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Таб = Новый ТаблицаЗначений;	
Если не РезультатЗапроса.Пустой() тогда 
	Таб = РезультатЗапроса.Выгрузить(); 
КонецЕсли;	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

Возврат Таб;	
	
КонецФункции

&НаКлиенте
Процедура Команда2(Команда)
СформироватьНаСервере2()
КонецПроцедуры
